
&НаКлиенте
Процедура ОтборПоставщикЗначениеПриИзменении(Элемент)
   УстановитьОтборПоПоставщику();	
КонецПроцедуры     

 &НаКлиенте
Процедура ОтборПоставщикФлагПриИзменении(Элемент)
    Этаформа.ОтборНоменклатураФлаг=Ложь;
	УстановитьОтборПоПоставщику();
КонецПроцедуры                    


&НаКлиенте
Процедура  УстановитьОтборПоПоставщику()
	Список.Отбор.Элементы.Очистить();
	ЭлементОтбораПоставщик=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораПоставщик.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Поставщик");
	ЭлементОтбораПоставщик.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораПоставщик.ПравоеЗначение=Этаформа.ОтборПоставщикЗначение;
	
	Если Этаформа.ОтборПоставщикФлаг Тогда
		ЭлементОтбораПоставщик.Использование=Истина;
	Иначе 
		ЭлементОтбораПоставщик.Использование=Ложь;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОтборНоменклатураЗначениеПриИзменении(Элемент)
	УстановитьОтборПоНоменклатуре();
КонецПроцедуры

&НаКлиенте
Процедура ОтборНоменклатураФлагПриИзменении(Элемент)
	Этаформа.ОтборПоставщикФлаг=Ложь;
	УстановитьОтборПоНоменклатуре();
КонецПроцедуры   

&НаКлиенте
Процедура  УстановитьОтборПоНоменклатуре()
	Список.Отбор.Элементы.Очистить();
	ЭлементОтбораНоменклатура=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораНоменклатура.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Номенклатура");
	ЭлементОтбораНоменклатура.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораНоменклатура.ПравоеЗначение=Этаформа.ОтборНоменклатураЗначение;
	
	Если Этаформа.ОтборНоменклатураФлаг Тогда
		ЭлементОтбораНоменклатура.Использование=Истина;
	Иначе 
		ЭлементОтбораНоменклатура.Использование=Ложь;
	КонецЕсли;
	
КонецПроцедуры



