

//ОБРАБОТКА ОСНОВНЫХ СОБЫТИЙ ДОКУМЕНТА	

 &НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)    
	
	Объект.СуммаДокумента=Объект.ТЧ_Материалы.Итог("Сумма");  
	
КонецПроцедуры 


//Получение актуальных цен для номенклатуры и услуг
 &НаКлиенте
Процедура ТЧ_МатериалыМатериалПриИзменении(Элемент)
	ТекущаяСтрока=Элементы.ТЧ_Материалы.ТекущиеДанные;
	ТекущаяСтрока.Цена=ПолучитьРозничнуюЦену(Объект.Дата, ТекущаяСтрока.Материал);              
	ТекущаяСтрока.Себестоимость=ПолучитьСебестоимость(Объект.Дата, ТекущаяСтрока.Материал);
	
	РассчитатьСумму(ТекущаяСтрока);
КонецПроцедуры  

&НаСервере 
Функция ПолучитьСебестоимость(АктуальнаяДата, Номенклатура)
	//1. Получение значения цены средствамифункции из общего модуля
	Результат=Себестоимость(АктуальнаяДата, Номенклатура);
	
	//2.Возврат результата для заполнения формы 
	Возврат Результат;
КонецФункции



//Расчет значения поля "Сумма" в ТЧ
&НаКлиенте
Процедура ТЧ_МатериалыКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТЧ_Материалы.ТекущиеДанные;
	РассчитатьСумму(ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_МатериалыЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТЧ_Материалы.ТекущиеДанные;
	РассчитатьСумму(ТекущаяСтрока);

КонецПроцедуры


//ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ  И ФУНКЦИИ
 &НаКлиенте
Процедура ДокументОснованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ЗаполнитьДаннымиИзОснования(ВыбранноеЗначение);
	Этаформа.Прочитать();
КонецПроцедуры    

&НаСервере
Процедура ЗаполнитьДаннымиИзОснования(ВыбранноеЗначение)
	
	ТекущийДокумент=Объект.Ссылка.ПолучитьОбъект();
	
	ТекущийДокумент.ТЧ_Материалы.Очистить();
	
	ТекущийДокумент.Заполнить(ВыбранноеЗначение);
	
	ТекущийДокумент.Записать();
	
КонецПроцедуры


&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	Объект.Курс=ПолучитьЗначениеКурса(Объект.Валюта, Объект.Дата);
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеКурса(Валюта, Дата) 
	Отбор=Новый Структура("Валюта", Валюта);
	Запись=РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата,Отбор);
	Результат=Запись.Кратность;
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ДекорацияНадписьВалютаНажатие(Элемент)
    ФормаРС=ПолучитьФорму("РегистрСведений.КурсыВалют.ФормаСписка");
	
	ФормаРС.Список.Отбор.Элементы.Очистить();
	
	ЭлементОтбора=ФормаРС.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение=ФормаРС.Список.отбор.ДоступныеПоляОтбора.Элементы.Найти("Валюта").Поле;
	ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение=Объект.Валюта;
	ЭлементОтбора.Использование=Истина;
	
	ФормаРС.Открыть();

КонецПроцедуры


&НаСервере
Функция ПолучитьРозничнуюЦену(АктуальнаяДата,Номенклатура)      
	Результат=РозничнаяЦена(АктуальнаяДата,Номенклатура);
	Возврат Результат;
КонецФункции

