
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОказаниеУслуг") Тогда
		// Заполнение шапки
		АдресДоставки = ДанныеЗаполнения.АдресДоставки;
		АдресОтправки = ДанныеЗаполнения.АдресОтправки;
		Водитель = ДанныеЗаполнения.Водитель;
		Клиент = ДанныеЗаполнения.Клиент;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
