
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ДС_РасчетныеСчета.Отбор.Элементы.Очистить();// Вставить содержимое обработчика.  
	
	НовЭлементОтбора = ДС_РасчетныеСчета.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовЭлементОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Владелец.Наименование"); 
	НовЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	НовЭлементОтбора.ПравоеЗначение=Элементы.Список.ТекущиеДанные.Наименование;
	
	НовЭлементОтбора.Использование = Истина;
КонецПроцедуры
