
&НаКлиенте
Процедура ОтборНоменклатураФлагПриИзменении(Элемент)
	УстановитьОтборПоНоменклатуре();
КонецПроцедуры

&НаКлиенте
Процедура ОтборНоменклатураЗначениеПриИзменении(Элемент)
УстановитьОтборПоНоменклатуре();
КонецПроцедуры   

&НаКлиенте
Процедура УстановитьОтборПоНоменклатуре()
	
	//Очищаем список от возможных предыдущих отборов
	Список.Отбор.Элементы.Очистить();
	
	//Устновить значения для отбора
	ЭлементОтбораНоменклатура=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораНоменклатура.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Номенклатура");
	ЭлементОтбораНоменклатура.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораНоменклатура.ПравоеЗначение=ЭтаФорма.ОтборНоменклатураЗначение;
	
	//Настройка выполнения отбора в зависимости от значения флажка
	Если ЭтаФорма.ОтборНоменклатураФлаг Тогда
		ЭлементОтбораНоменклатура.Использование=Истина; 
		Иначе
		ЭлементОтбораНоменклатура.Использование=Ложь;
	КонецЕсли;

КонецПроцедуры
