
&НаКлиенте
Процедура КомандаСформироватьОтчет(Команда)
	Отчет();
КонецПроцедуры  

&НаСервере
Процедура Отчет()  

//1. Предварительный этап
	Табдок = ТабличныйДокумент; // указываем тип выходных данных
	ТабДок.Очистить (); // очищаем на случай повторной формировки
	ТабДок.ТолькоПросмотр = Истина;//даем право только на просмотр

//2. Получаем созданный ранее макет с помощью вспомогательной процедуры
	Макет = ПолучитьМакетНаСервере ("Макет") ;

//2.1. Получаем области мажета и выводим их
	ОбластьЗаголовок = Макет.ПолучитьОбласть ("ОбластьЗаголовок") ;
	Табдок.Вывести(ОбластьЗаголовок) ;

	ОбластьШапка = Макет.ПолучитьОбласть ("ОбластьШапка");
	Табдок.Вывести(ОбластьШапка) ;

 

	ОбластьДанные = Макет.ПолучитьОбласть ("ОбластьДанные") ;

//2.1.1 Получаем данные для вывода в отчет
	ЗапросДанных = Новый Запрос;

ЗапросДанных.Текст = 
 "ВЫБРАТЬ
 |	ОказаниеУслуг.Дата КАК Дата,
 |	ОказаниеУслуг.Номер КАК Номер,
 |	ОказаниеУслуг.Склад КАК Склад,
 |	ОказаниеУслуг.Водитель КАК Водитель
 |ИЗ
 |	Документ.ОказаниеУслуг КАК ОказаниеУслуг
 |
 |УПОРЯДОЧИТЬ ПО
 |	Дата,
 |	ОказаниеУслуг.Ссылка" ;    

  ВыборкаДанных=ЗапросДанных.Выполнить().Выбрать();
//2.1.2 Тут будет производится заполнение полученных данных

Пока ВыборкаДанных.Следующий() Цикл
	ОбластьДанные.Параметры.Дата = ВыборкаДанных.Дата;   
	ОбластьДанные.Параметры.Номер = ВыборкаДанных.Номер;
	ОбластьДанные.Параметры.Склад = ВыборкаДанных.Склад;
    ОбластьДанные.Параметры.Водитель = ВыборкаДанных.Водитель;    
	ТабДок.Вывести(ОбластьДанные);
КонецЦикла;

 

//3. Заключительный этап - настройка вывода табличного документа

	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.МасштабПечати = 100; // это значит что масштаб будет 100 процентов

	ТабДок.РазмерСтраницы = "A4";
	ТабДок.ТочностьПечати = ТочностьПечати.Точная;

 

КонецПроцедуры   

//Вспомогательное
&НаСервере
Функция ПолучитьМакетНаСервере(ИмяМакета)
	
	ЭО=РеквизитФормыВЗначение("Отчет");
	Макет=ЭО.ПолучитьМакет(ИмяМакета);
	Возврат Макет;
КонецФункции
