
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Счет") Тогда
		// Заполнение шапки
		Валюта = ДанныеЗаполнения.Валюта;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Курс = ДанныеЗаполнения.Курс;
		Склад = ДанныеЗаполнения.Склад;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		Для Каждого ТекСтрокаТЧ_Материалы Из ДанныеЗаполнения.ТЧ_Материалы Цикл
			НоваяСтрока = ТЧ_Материалы.Добавить();
			НоваяСтрока.Количество = ТекСтрокаТЧ_Материалы.Количество;
			НоваяСтрока.Материал = ТекСтрокаТЧ_Материалы.Материал;
			НоваяСтрока.Сумма = ТекСтрокаТЧ_Материалы.Сумма;
			НоваяСтрока.Цена = ТекСтрокаТЧ_Материалы.Цена; 
			НоваяСтрока.Скидка=ТекСтрокаТЧ_Материалы.Скидка;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	
		// регистр ОстаткиНоменклатуры Расход
	Движения.ОстаткиНоменклатуры.Записывать = Истина;  
	//1.Обращение к регистру накопления
	ОстаткиТов=РегистрыНакопления.ОстаткиНоменклатуры;
	
	Для Каждого ТекСтрокаТЧ_Материалы Из ТЧ_Материалы Цикл
	//2. Создаем вспомогательные переменные
	    ТекТовар=ТекСтрокаТЧ_Материалы.Материал;
		ТекСклад=Склад;
	//3. Настраиваем отбор
	    ОтборТов=Новый Структура();
		ОтборТов.Вставить("Номенклатура", ТекТовар);
		ОтборТов.Вставить("Склад", ТекСклад);
	//4. Формируем таблицу остатков и записываем остаточное количество товара на складе
	    ТаблицаОстатков=ОстаткиТов.Остатки(МоментВремени(), ОтборТов, "Номенклатура", "Количество");
		Остаток=ТаблицаОстатков.Итог("Количество");
	//5. Заключаем движение в условный оператор
	   Если Остаток >=ТекСтрокаТЧ_Материалы.Количество Тогда
		   Движение = Движения.ОстаткиНоменклатуры.Добавить();
		   Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		   Движение.Период = Дата;
		   Движение.Номенклатура = ТекСтрокаТЧ_Материалы.Материал; 
		   Движение.НаборСвойств = ТекСтрокаТЧ_Материалы.НаборСвойств;
		   Движение.Склад = Склад;
		   Движение.Количество = ТекСтрокаТЧ_Материалы.Количество;
		   Движение.Сумма = ТекСтрокаТЧ_Материалы.Себестоимость*ТекСтрокаТЧ_Материалы.Количество;  
	   Иначе
		    Сообщить ("На складе "+ Склад+ " недостаточно товара"+ ТекТовар+"! Документ не проводится!");
		    Отказ=Истина; // Запрещаем провндение
		    Возврат;// Выходим из процедуры 
	   КонецЕсли;
		
	КонецЦикла;

	
	
	// регистр Продажи 
	Движения.Продажи.Записывать = Истина;
	Для Каждого ТекСтрокаТЧ_Материалы Из ТЧ_Материалы Цикл
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТЧ_Материалы.Материал;
		Движение.Клиент = Контрагент;
		Движение.Количество = ТекСтрокаТЧ_Материалы.Количество;
		Движение.Выручка = ТекСтрокаТЧ_Материалы.Сумма-ТекСтрокаТЧ_Материалы.Себестоимость*ТекСтрокаТЧ_Материалы.Количество;
		Движение.Стоимость = ТекСтрокаТЧ_Материалы.Сумма;
	КонецЦикла;

	
	
	// регистр Покупатели Приход
	Движения.Покупатели.Записывать = Истина;
	Движение = Движения.Покупатели.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Клиент = Контрагент;
	Движение.НаборСвойств = НаборСвойствКлиента;
	Движение.Долг = СуммаДокумента;

	// регистр Управленческий 
	Движения.Управленческий.Записывать = Истина;
	Движение = Движения.Управленческий.Добавить();
	Движение.СчетДт = ПланыСчетов.Основной.РасчетыСПокупателями;
	Движение.СчетКт = ПланыСчетов.Основной.Капитал;
	Движение.Период = Дата;
	Движение.Сумма = СуммаДокумента;
	Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Клиенты] = Контрагент;

	// регистр Управленческий 
	Движения.Управленческий.Записывать = Истина;
	Для Каждого ТекСтрокаТЧ_Материалы Из ТЧ_Материалы Цикл
		Движение = Движения.Управленческий.Добавить();
		Движение.СчетДт = ПланыСчетов.Основной.Капитал;
		Движение.СчетКт = ПланыСчетов.Основной.Товары;
		Движение.Период = Дата;
		Движение.Сумма = ТекСтрокаТЧ_Материалы.Себестоимость*ТекСтрокаТЧ_Материалы.Количество;
		Движение.КоличествоКт = ТекСтрокаТЧ_Материалы.Количество;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Материалы] = ТекСтрокаТЧ_Материалы.Материал;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Склады] = Склад;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
