
&НаКлиенте
Процедура КомандаСформироватьОтчет(Команда)
	Отчет();
КонецПроцедуры  

&НаСервере
Процедура Отчет() 
	
//1. Предварительный этап
	ТабДок = ТабличныйДокумент; //указываем тип выходных данных
	ТабДок.Очистить();//очищаем на случай повторной формировки
	ТабДок.ТолькоПросмотр=Истина;//даем право только на просмотр
	
//2. Получаем созданный ранее макет с помощью вспомогательной процедуры
	Макет = ПолучитьМакетНаСервере("Макет"); 
	
//2.1. Получаем области макета и выводим их
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ОбластьЗаголовок");
	ТабДок.Вывести(ОбластьЗаголовок);
	
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ТабДок.Вывести(ОбластьШапка);
	
	ОбластьДанные = Макет.ПолучитьОбласть("ОбластьДанные");
	
//2.1.1 Получаем данные для вывода в отчет
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиНоменклатурыОстаткиИОбороты.Номенклатура КАК Номенклатура,
	|	ОстаткиНоменклатурыОстаткиИОбороты.НаборСвойств КАК НаборСвойств,
	|	ОстаткиНоменклатурыОстаткиИОбороты.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
	|	ОстаткиНоменклатурыОстаткиИОбороты.КоличествоПриход КАК КоличествоПриход,
	|	ОстаткиНоменклатурыОстаткиИОбороты.КоличествоРасход КАК КоличествоРасход,
	|	ОстаткиНоменклатурыОстаткиИОбороты.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиНоменклатуры.ОстаткиИОбороты(, , , , НаборСвойств В
	|   	(ВЫБРАТЬ
	|			ЗначенияСвойствНоменклатуры.НаборСвойств КАК НаборСвойств
	|		ИЗ
	|			РегистрСведений.ЗначенияСвойствНоменклатуры КАК ЗначенияСвойствНоменклатуры
	|		ГДЕ ";
	
	Если не Отчет.Материал.Пустая() Тогда
		ЗапросДанных.Текст = ЗапросДанных.Текст +
					"ЗначенияСвойствНоменклатуры.НаборСвойств.Владелец = &Материал
	|	        И ";
	КонецЕсли;
	
	ЗапросДанных.Текст = ЗапросДанных.Текст +
				"ЗначенияСвойствНоменклатуры.ВидСвойства = &ВидСвойства
	|			И ЗначенияСвойствНоменклатуры.Значение = &Значение)) 
	|КАК ОстаткиНоменклатурыОстаткиИОбороты    
	|	
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура";
	
	//2.1.1.1. Установка параметров запроса
	Если Не Отчет.Материал.Пустая() Тогда
		ЗапросДанных.УстановитьПараметр("Материал", Отчет.Материал);
	КонецЕсли;
	ЗапросДанных.УстановитьПараметр("ВидСвойства", Отчет.Свойство);
	ЗапросДанных.УстановитьПараметр("Значение", Отчет.ЗначенияСвойства);
	
	
	ВыборкаДанных = ЗапросДанных.Выполнить().Выбрать();                  
	
//2.1.2 Тут будет производится заполнение полученных данных  

Пока ВыборкаДанных.Следующий() Цикл 
	ОбластьДанные.Параметры.Номенклатура = ВыборкаДанных.Номенклатура;
	ОбластьДанные.Параметры.НаборСвойств = ВыборкаДанных.НаборСвойств;
	ОбластьДанные.Параметры.НачальныйОстаток= ВыборкаДанных.КоличествоНачальныйОстаток;
	ОбластьДанные.Параметры.Приход = ВыборкаДанных.КоличествоПриход;
	ОбластьДанные.Параметры.Расход = ВыборкаДанных.КоличествоРасход;
	ОбластьДанные.Параметры.КонечныйОстаток = ВыборкаДанных.КоличествоКонечныйОстаток;
	ТабДок.Вывести(ОбластьДанные,ВыборкаДанных.Уровень());
КонецЦикла;




//3. Заключительный этап - настройка вывода табличного документа

ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
ТабДок.МасштабПечати = 100;

ТабДок.РазмерСтраницы = "A4";
ТабДок.ТочностьПечати = ТочностьПечати.Точная;
	
	
КонецПроцедуры  

//ВСПОМОГАТЕЛЬНОЕ
  &НаСервере
Функция ПолучитьМакетНаСервере(ИмяМакета)
	
	ЭО = РеквизитФормыВЗначение("Отчет");
	Макет = ЭО.ПолучитьМакет(ИмяМакета);
	Возврат Макет;    
	
КонецФункции
