
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//1. Задаем значение типа диаграммы по умолчанию
		//+ тут же система автоматически подгружает остальные возможные варианты в список
		ПолеВыбораТипаДиаграммы=ТипДиаграммы.Гистограмма;
	//2. Задаем тип диаграммы
	Диаграмма.ТипДиаграммы=ПолеВыбораТипаДиаграммы;
КонецПроцедуры

&НаКлиенте
Процедура ПолеВыбораТипаДиаграммыПриИзменении(Элемент)
	
	Диаграмма.ТипДиаграммы=ПолеВыбораТипаДиаграммы;
	
КонецПроцедуры

&НаСервере
Процедура КомандаСформироватьДиаграммуНаСервере()
	ЗапросДанных=Новый Запрос;
	ЗапросДанных.Текст=
	"ВЫБРАТЬ
	|	ПродажиОбороты.Клиент КАК Клиент,
	|	ПродажиОбороты.ВыручкаОборот - ПродажиОбороты.СтоимостьОборот КАК Доход
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты КАК ПродажиОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Доход УБЫВ";
	
	//2. Получаем выборку данных и заполняем диаграмму
	ВыборкаДанных = ЗапросДанных.Выполнить () .Выбрать();

	//2.1. Запрещаем обновление и автотранспонирование диаграммы
	Диаграмма.Обновление = Ложь;
	Диаграмма. АвтоТранспонирование = Ложь;

	//2.2 Создаем единственную точку диаграммы
	ТочкаДиаграммы = Диаграмма .УстановитьТочку ("Доход");

	//2.3 Перебираем выборку результата запроса и создем серии и их значения
	Пока ВыборкаДанных.Следующий() Цикл

		ТекущаяСерияДиаграммы = Диаграмма.УстановитьСерию (ВыборкаДанных .Клиент);
		Диаграмма. УстановитьЗначение (ТочкаДиаграммы, ТекущаяСерияДиаграммы, ВыборкаДанных . Доход);
	КонецЦикла;

	//2.4. Разрешить обновление и автотранспонирование диаграммы
	Диаграмма.Обновление = Истина;
	Диаграмма. АвтоТранспонирование = Истина;
	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСформироватьДиаграмму(Команда)
	КомандаСформироватьДиаграммуНаСервере();
КонецПроцедуры
