
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Счет") Тогда
		// Заполнение шапки
		Валюта = ДанныеЗаполнения.Валюта;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Курс = ДанныеЗаполнения.Курс;
		Склад = ДанныеЗаполнения.Склад;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		Для Каждого ТекСтрокаТЧ_Материалы Из ДанныеЗаполнения.ТЧ_Материалы Цикл
			НоваяСтрока = ТЧ_Материалы.Добавить();
			НоваяСтрока.Количество = ТекСтрокаТЧ_Материалы.Количество;
			НоваяСтрока.Материал = ТекСтрокаТЧ_Материалы.Материал;
			НоваяСтрока.Сумма = ТекСтрокаТЧ_Материалы.Сумма;
			НоваяСтрока.Цена = ТекСтрокаТЧ_Материалы.Цена;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
