
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ОказаниеУслуг.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОказаниеУслуг.Валюта,
	|	ОказаниеУслуг.ВидОплаты,
	|	ОказаниеУслуг.Дата,
	|	ОказаниеУслуг.Клиент,
	|	ОказаниеУслуг.Курс,
	|	ОказаниеУслуг.Водитель,
	|	ОказаниеУслуг.Номер,
	|	ОказаниеУслуг.Склад,
	|	ОказаниеУслуг.СуммаДокумента,
	|	ОказаниеУслуг.ТЧ_ПереченьНоменклатуры.(
	|		НомерСтроки,
	|		Материал,  
	|       Материал.Ссылка КАК Ссылка,
	|		Цена,
	|		Количество,
	|		Сумма,
	|		Себестоимость
	|	),
	|	ОказаниеУслуг.ТЧ_Услуги.(
	|		НомерСтроки,
	|		Номенклатура,
	|       Номенклатура.Ссылка КАК Ссылка,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.ОказаниеУслуг КАК ОказаниеУслуг
	|ГДЕ
	|	ОказаниеУслуг.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");     
	ОбластьТЧ_ПереченьНоменклатурыШапка = Макет.ПолучитьОбласть("ТЧ_ПереченьНоменклатурыШапка");
	ОбластьТЧ_ПереченьНоменклатуры = Макет.ПолучитьОбласть("ТЧ_ПереченьНоменклатуры");
	ОбластьТЧ_УслугиШапка = Макет.ПолучитьОбласть("ТЧ_УслугиШапка");
	ОбластьТЧ_Услуги = Макет.ПолучитьОбласть("ТЧ_Услуги");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень()); 
		
		
		ВыборкаТЧ_ПереченьНоменклатуры = Выборка.ТЧ_ПереченьНоменклатуры.Выбрать();
		Если     ВыборкаТЧ_ПереченьНоменклатуры.Количество() Тогда
		ТабДок.Вывести(ОбластьТЧ_ПереченьНоменклатурыШапка);
		
		Пока ВыборкаТЧ_ПереченьНоменклатуры.Следующий() Цикл
			ОбластьТЧ_ПереченьНоменклатуры.Параметры.Заполнить(ВыборкаТЧ_ПереченьНоменклатуры);
			
			//Расшифровка ячейки "Материал"
			ОбластьТЧ_ПереченьНоменклатуры.Параметры.Ссылка=ВыборкаТЧ_ПереченьНоменклатуры.Ссылка; 
			
			ТабДок.Вывести(ОбластьТЧ_ПереченьНоменклатуры, ВыборкаТЧ_ПереченьНоменклатуры.Уровень());
		КонецЦикла;
		КонецЕсли;
		

		ТабДок.Вывести(ОбластьТЧ_УслугиШапка);
		ВыборкаТЧ_Услуги = Выборка.ТЧ_Услуги.Выбрать();
		Пока ВыборкаТЧ_Услуги.Следующий() Цикл
			ОбластьТЧ_Услуги.Параметры.Заполнить(ВыборкаТЧ_Услуги);
			
			//Расшифровка ячейки "Услуги"
			ОбластьТЧ_Услуги.Параметры.Ссылка=ВыборкаТЧ_Услуги.Ссылка; 
			
			ТабДок.Вывести(ОбластьТЧ_Услуги, ВыборкаТЧ_Услуги.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		//Вывод сумы документа прописью
		ПараметрыПредметаИсчисления="рубль,рубля,рублей,м,копейка,копейки,копеек,ж,2";
		ФорматнаяСтрока="Л=ru_RU";
		Подвал.Параметры.СуммаПрописью=ЧислоПрописью(Подвал.Параметры.СуммаДокумента, ФорматнаяСтрока, ПараметрыПредметаИсчисления);
		
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
