
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиНоменклатуры Расход  
	
	Движения.ОстаткиНоменклатуры.Записывать = Истина;   
	//1.Обращение к регистру накопления
	ОстаткиТов=РегистрыНакопления.ОстаткиНоменклатуры;
	
	Для Каждого ТекСтрокаТЧ_ПереченьНоменклатуры Из ТЧ_ПереченьНоменклатуры Цикл   
	//2. Создаем вспомогательные переменные
	    ТекТовар=ТекСтрокаТЧ_ПереченьНоменклатуры.Материал;
		ТекСклад=Склад;
	//3. Настраиваем отбор
	    ОтборТов=Новый Структура();
		ОтборТов.Вставить("Номенклатура", ТекТовар);
		ОтборТов.Вставить("Склад", ТекСклад);
	//4. Формируем таблицу остатков и записываем остаточное количество товара на складе
	    ТаблицаОстатков=ОстаткиТов.Остатки(МоментВремени(), ОтборТов, "Номенклатура", "Количество");
		Остаток=ТаблицаОстатков.Итог("Количество");
	//5. Заключаем движение в условный оператор
	   Если Остаток >=ТекСтрокаТЧ_ПереченьНоменклатуры.Количество Тогда	
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТЧ_ПереченьНоменклатуры.Материал; 
		Движение.НаборСвойств = ТекСтрокаТЧ_ПереченьНоменклатуры.НаборСвойств;
		Движение.Склад = Склад;
		Движение.Количество = ТекСтрокаТЧ_ПереченьНоменклатуры.Количество;
		Движение.Сумма = ТекСтрокаТЧ_ПереченьНоменклатуры.Себестоимость*ТекСтрокаТЧ_ПереченьНоменклатуры.Количество;
	Иначе 
		Сообщить ("На складе "+ Склад+ " недостаточно товара "+ ТекТовар+"! Документ не проводится!");
		Отказ=Истина; // Запрещаем провндение
		Возврат;// Выходим из процедуры 
	   КонецЕсли;
		
	КонецЦикла;
	
	//Регистр продажи
	Движения.Продажи.Записывать=Истина;
	Для Каждого ТекСтрокаТЧ_Услуги Из ТЧ_Услуги Цикл
		Движение=Движения.Продажи.Добавить();
		Движение.Период=Дата;
		Движение.Номенклатура=ТекСтрокаТЧ_Услуги.Номенклатура;
		Движение.Клиент=Клиент;
		Движение.Водитель=Водитель;
		Движение.Количество=1;
		Движение.Выручка=ТекСтрокаТЧ_Услуги.Сумма;
	КонецЦикла;  
	
	//Регистр покупателей
	Движения.Покупатели.Записывать=Истина;
	Для Каждого ТекСтрокаТЧ_ПереченьНоменклатуры Из ТЧ_ПереченьНоменклатуры Цикл
		Движение=Движения.Покупатели.Добавить();
		Движение.ВидДвижения=ВидДвиженияНакопления.Приход;
		Движение.Период=Дата;
		Движение.Клиент=Клиент;
		Движение.НаборСвойств=НаборСвойствКлиента;
		Движение.Долг=СуммаДокумента;
	КонецЦикла;  
	

	
	// регистр Управленческий 
	Движения.Управленческий.Записывать = Истина;
	Движение = Движения.Управленческий.Добавить();
	Движение.СчетДт = ПланыСчетов.Основной.РасчетыСПокупателями;
	Движение.СчетКт = ПланыСчетов.Основной.Капитал;
	Движение.Период = Дата;
	Движение.Сумма = СуммаДокумента;
	Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Клиенты] = Клиент;

	// регистр Управленческий 
	Движения.Управленческий.Записывать = Истина;
	Для Каждого ТекСтрокаТЧ_ПереченьНоменклатуры Из ТЧ_ПереченьНоменклатуры Цикл
		Движение = Движения.Управленческий.Добавить();
		Движение.СчетДт = ПланыСчетов.Основной.Капитал;
		Движение.СчетКт = ПланыСчетов.Основной.Товары;
		Движение.Период = Дата;
		Движение.Сумма = ТекСтрокаТЧ_ПереченьНоменклатуры.Себестоимость*ТекСтрокаТЧ_ПереченьНоменклатуры.Количество;
		Движение.КоличествоКт = ТекСтрокаТЧ_ПереченьНоменклатуры.Количество;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Материалы] = ТекСтрокаТЧ_ПереченьНоменклатуры.Материал;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Склады] = Склад;
	КонецЦикла;

	// регистр Управленческий 
	Движения.Управленческий.Записывать = Истина;
	Для Каждого ТекСтрокаТЧ_Услуги Из ТЧ_Услуги Цикл
		Движение = Движения.Управленческий.Добавить();
		Движение.СчетДт = ПланыСчетов.Основной.Капитал;
		Движение.СчетКт = ПланыСчетов.Основной.Товары;
		Движение.Период = Дата;
		Движение.Сумма = ТекСтрокаТЧ_Услуги.Сумма;
		Движение.КоличествоКт = 1;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Материалы] = ТекСтрокаТЧ_Услуги.Номенклатура;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Склады] = Склад;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
