Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
  
  Пользователь = Справочники.Сотрудники.НайтиПоНаименованию(ИмяПользователя());
  Если НЕ ПустаяСтрока(Пользователь) Тогда
    Сообщить("Установлен пользователь: " + Пользователь);
    
    ПараметрыСеанса.ТекущийИсполнитель = Пользователь;
  КонецЕсли;
  
  Сообщить(ПолучитьПараметрСеанса());
КонецПроцедуры

Функция ПолучитьПараметрСеанса() Экспорт
  
  Попытка 
    
    Возврат ("Параметр сеанса <Текущий исполнитель> установлен, Вы идентифицированы как "
            + ПараметрыСеанса.ТекущийИсполнитель.Наименование + ".");
  Исключение
    
    Возврат ("Параметр сеанса <Текущий исполнитель> не установлен, Вы вошли в систему как "
            + ИмяПользователя() + ".");
        
  КонецПопытки;
            
КонецФункции


