
&НаСервереБезКонтекста
Функция ПечатьНаСервере()
	// Вставить содержимое обработчика.
	СхемаКомпоновкиДанных=Отчеты.СписокНоменклатуры.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	Настройки=СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	КомпоновщикМакета=Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки=КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки);
	
	ПроцессорКомпоновкиДанных=Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ДокументРезультат = Новый ТабличныйДокумент;
	ПроцессорВывода= Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Возврат ДокументРезультат;
	
КонецФункции

&НаКлиенте
Процедура Печать(Команда)
	Результат=ПечатьНаСервере();
	Результат.ОтображатьСетку=Ложь;
	Результат.ОтображатьЗаголовки=Ложь;
	Результат.Показать();
КонецПроцедуры
