
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		// Заполнение шапки
		Валюта = ДанныеЗаполнения.Валюта;
		КонтактноеЛицо = ДанныеЗаполнения.Контрагент;
		Курс = ДанныеЗаполнения.Курс;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Касса Расход  
	
	Движения.Касса.Записывать = Истина; 
	//1.Обращение к регистру накопления
	ОстаткиСум=РегистрыНакопления.Касса;
	
	ТаблицаОстатков=ОстаткиСум.Остатки(МоментВремени());
	Остаток=ТаблицаОстатков.Итог("Сумма");
	
	Если Остаток>=СуммаДокумента Тогда
		Движение = Движения.Касса.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Сумма = СуммаДокумента;
		Движение.КонтактноеЛицо = КонтактноеЛицо;  
	Иначе 
		Сообщить ("В кассе недостаточно средств"+ "! Документ не проводится!");
		Отказ=Истина; // Запрещаем провндение
		Возврат;// Выходим из процедуры 
	КонецЕсли;

	// регистр Поставщики Расход
	Движения.Поставщики.Записывать = Истина;
	Движение = Движения.Поставщики.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Контрагент = КонтактноеЛицо;
	Движение.Долг = СуммаДокумента;

	// регистр Управленческий 
	Движения.Управленческий.Записывать = Истина;
	Движение = Движения.Управленческий.Добавить();
	Движение.СчетДт = ПланыСчетов.Основной.РасчетыСПоставщиками;
	Движение.СчетКт = ПланыСчетов.Основной.Касса;
	Движение.Период = Дата;
	Движение.Сумма = СуммаДокумента;
	Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = КонтактноеЛицо;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
