
&НаКлиенте
Процедура ТЧ_МатериалыКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТЧ_Материалы.ТекущиеДанные;
	РассчитатьСумму(ТекущаяСтрока);
	Объект.СуммаДокумента = Объект.ТЧ_Материалы.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_МатериалыЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТЧ_Материалы.ТекущиеДанные;
	РассчитатьСумму(ТекущаяСтрока);
	Объект.СуммаДокумента = Объект.ТЧ_Материалы.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.СуммаДокумента = Объект.ТЧ_Материалы.Итог("Сумма");
КонецПроцедуры


&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	Объект.Курс=ПолучитьЗначениеКурса(Объект.Валюта, Объект.Дата);
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеКурса(Валюта, Дата) 
	Отбор=Новый Структура("Валюта", Валюта);
	Запись=РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата,Отбор);
	Результат=Запись.Кратность;
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ДекорацияНадписьВалютаНажатие(Элемент)
	ФормаРС=ПолучитьФорму("РегистрСведений.КурсыВалют.ФормаСписка");
	
	ФормаРС.Список.Отбор.Элементы.Очистить();
	
	ЭлементОтбора=ФормаРС.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение=ФормаРС.Список.отбор.ДоступныеПоляОтбора.Элементы.Найти("Валюта").Поле;
	ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение=Объект.Валюта;
	ЭлементОтбора.Использование=Истина;
	
	ФормаРС.Открыть();
КонецПроцедуры


