&НаСервере    
Функция РозничнаяЦена(АктуальнаяДата, Номенклатура) Экспорт
	Отбор=Новый Структура("Номенклатура", Номенклатура);
	Результат=РегистрыСведений.ЦеныНоменклатуры.ПолучитьПоследнее(АктуальнаяДата,Отбор);
	Возврат Результат.Цена;
КонецФункции


&НаСервере 
Функция Себестоимость(АктуальнаяДата, Номенклатура) Экспорт
	
	//1 Создаем структуру для отбора
	Отбор=Новый Структура("Номенклатура", Номенклатура);
	
	//2. Получаем необходимое значение ресурса Цена
	Результат=РегистрыСведений.ЦеныПоставщиков.ПолучитьПоследнее(АктуальнаяДата, Отбор);
	
	//3. Возвращаем результат
	Возврат Результат.Цена;
	
КонецФункции