
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Справочники.Сотрудники.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Сотрудники.ДатаРождения,
	|	Сотрудники.Должность,
	|	Сотрудники.Код,
	|	Сотрудники.Наименование,
	|	Сотрудники.Образование,
	|	Сотрудники.Пол,
	|	Сотрудники.ТЧ_ТрудоваяДеятельность.(
	|		НомерСтроки,
	|		Организация,
	|		НачалоРаботы,
	|		ОкончаниеРаботы,
	|		Должность
	|	)
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТЧ_ТрудоваяДеятельностьШапка = Макет.ПолучитьОбласть("ТЧ_ТрудоваяДеятельностьШапка");
	ОбластьТЧ_ТрудоваяДеятельность = Макет.ПолучитьОбласть("ТЧ_ТрудоваяДеятельность");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТЧ_ТрудоваяДеятельностьШапка);
		ВыборкаТЧ_ТрудоваяДеятельность = Выборка.ТЧ_ТрудоваяДеятельность.Выбрать();
		Пока ВыборкаТЧ_ТрудоваяДеятельность.Следующий() Цикл
			ОбластьТЧ_ТрудоваяДеятельность.Параметры.Заполнить(ВыборкаТЧ_ТрудоваяДеятельность);
			ТабДок.Вывести(ОбластьТЧ_ТрудоваяДеятельность, ВыборкаТЧ_ТрудоваяДеятельность.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
