
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЦеныПоставщиков
	Движения.ЦеныПоставщиков.Записывать = Истина;
	Для Каждого ТекСтрокаТЧ_Материалы Из ТЧ_Материалы Цикл
		Движение = Движения.ЦеныПоставщиков.Добавить();
		Движение.Период = Дата;
		Движение.Поставщик = Контрагент;
		Движение.Номенклатура = ТекСтрокаТЧ_Материалы.Материал;
		Движение.Цена = ТекСтрокаТЧ_Материалы.Цена;
	КонецЦикла;

	// регистр ОстаткиНоменклатуры Приход
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаТЧ_Материалы Из ТЧ_Материалы Цикл
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТЧ_Материалы.Материал;
		Движение.Склад = Склад;
		Движение.НаборСвойств = ТекСтрокаТЧ_Материалы.НаборСвойств;
		Движение.Количество = ТекСтрокаТЧ_Материалы.Количество;
		Движение.Сумма = ТекСтрокаТЧ_Материалы.Сумма;
	КонецЦикла;

	// регистр Закупки 
	Движения.Закупки.Записывать = Истина;
	Для Каждого ТекСтрокаТЧ_Материалы Из ТЧ_Материалы Цикл
		Движение = Движения.Закупки.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТЧ_Материалы.Материал;
		Движение.Контрагент = Контрагент;
		Движение.Количество = ТекСтрокаТЧ_Материалы.Количество;
		Движение.Стоимость = ТекСтрокаТЧ_Материалы.Сумма;
	КонецЦикла;

	// регистр Поставщики Приход
	Движения.Поставщики.Записывать = Истина;
	Для Каждого ТекСтрокаТЧ_Материалы Из ТЧ_Материалы Цикл
		Движение = Движения.Поставщики.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Долг = ТекСтрокаТЧ_Материалы.Сумма;
	КонецЦикла;

	// регистр Управленческий 
	Движения.Управленческий.Записывать = Истина;
	Для Каждого ТекСтрокаТЧ_Материалы Из ТЧ_Материалы Цикл
		Движение = Движения.Управленческий.Добавить();
		Движение.СчетДт = ПланыСчетов.Основной.Товары;
		Движение.СчетКт = ПланыСчетов.Основной.РасчетыСПоставщиками;
		Движение.Период = Дата;
		Движение.Сумма = ТекСтрокаТЧ_Материалы.Сумма;
		Движение.КоличествоДт = ТекСтрокаТЧ_Материалы.Количество;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Материалы] = ТекСтрокаТЧ_Материалы.Материал;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Склады] = Склад;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Контрагент;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
