
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	// Вставить содержимое обработчика.
	ДС_Дети.Отбор.Элементы.Очистить(); //очищаем ДС от возможных предыдущих отборов 
	
	НовЭлементОтбора = ДС_Дети.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец.Код");
	НовЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	НовЭлементОтбора.ПравоеЗначение = Элементы.Список.ТекущиеДанные.Код;
	
	НовЭлементОтбора.Использование = Истина; //разрешаем использование созданного отбора  
КонецПроцедуры
