
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Начисления
	Движения.Начисления.Записывать = Истина;
	Для Каждого ТекСтрокаТЧ_Начисления Из ТЧ_Начисления Цикл
		Движение = Движения.Начисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаТЧ_Начисления.ВидРасчета;
		Движение.ПериодДействияНачало = ТекСтрокаТЧ_Начисления.ДатаНачала;
		Движение.ПериодДействияКонец = КонецДня(ТекСтрокаТЧ_Начисления.ДатаОкончания);
		Движение.ПериодРегистрации = ТекСтрокаТЧ_Начисления.ДатаНачала;
		Движение.БазовыйПериодНачало = ТекСтрокаТЧ_Начисления.ДатаНачала;
		Движение.БазовыйПериодКонец = КонецДня(ТекСтрокаТЧ_Начисления.ДатаОкончания);
		Движение.Сотрудник = ТекСтрокаТЧ_Начисления.Сотрудник;
		Движение.ГрафикРаботы = ТекСтрокаТЧ_Начисления.ГрафикРаботы;
		Движение.ИсходныеДанные = ТекСтрокаТЧ_Начисления.Результат;
	КонецЦикла;
	
	
	//Записываем движения регистров
	Движения.Начисления.Записать();
	
	//Получим список всех сотрудников, содержащихся в документе
	Запрос= Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	НачисленияСотрудникамНачисления.Сотрудник
	|ИЗ
	|	Документ.НачисленияСотрудникам.ТЧ_Начисления КАК НачисленияСотрудникамНачисления
	|ГДЕ
	|	НачисленияСотрудникамНачисления.Ссылка = &ТекущийДокумент");
	
	Запрос.УстановитьПараметр("ТекущийДокумент",Ссылка);
	
	//Сформируем список сотрудников
	
	ТаблЗнач = Запрос.Выполнить().Выгрузить();
	МассивСотрудников=ТаблЗнач.ВыгрузитьКолонку("Сотрудник");
	
	РассчитатьНачисления(Движения.Начисления, ПланыВидовРасчета.ОсновныеНачисления.Оклад, МассивСотрудников);
	Движения.Начисления.Записать( ,Истина);
	
	РассчитатьНачисления(Движения.Начисления, ПланыВидовРасчета.ОсновныеНачисления.Премия, МассивСотрудников);
	Движения.Начисления.Записать( ,Истина);
	
	РассчитатьНачисления(Движения.Начисления, ПланыВидовРасчета.ОсновныеНачисления.Больничный, МассивСотрудников);
	Движения.Начисления.Записать( ,Истина)
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
